package oop;

public class Ex01 {

	public static void main(String[] args) {
		// oop: object oriented programming (객체 지향 프로그래밍)
		// 자바코드의 기본 단위는 클래스이다.
		
		// pp: procedrual programming (절차지향프로그래밍)
		// procedure: 큰 범위에서는 함수의 의미를 지닌다.(function, method, procedure, routine....) 
		// c언어: 함수를 짜면 자료형이 보조
		// 자바: 함수만 있는 것이 아님.
		
		// 단순 자료형으로는 사람이 생각하는 데이터를 표현하는데 한계가 있다.
		// 단순 데이터를 만들어서 사용하기 위한 형태 : 변수
		// 같은 자료형의 여러 데이터를 묶어서 표현하기 위한 형태: 배열
		// 서로 다른 자료형의 여러 데이터를 묶어서 새로운 자료형을 표현하기 위한 형태: 구조체(c)
		// 서로 다른 자료형의 여러 데이터  + 동작, 기능    을 표현하기 위한 함수를 포함하는 형태: 클래스
		// -> 기본자료형으로 나타낼 수 없는 내 자신만의 자료형을 뽑아내는 도구
		
		// 구조체에 의해 만들어진 데이터는 속성만 담고있어서 함수를 필수로 동반해야함.
		// A타입의 해당 함수를 내장시키면, A는 속성과 기능을 동시에 포함하는 형태가 된다. <- 객체
		// 객체를 만들어내기 위한 자료형을 클래스 라고 한다.
		
		
		
	}

}
